oc/+Mode.org
#+TITLE: Mode

* lexical
#+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
#+end_src

* auto save

#+begin_src emacs-lisp
(require 'auto-save)
(setq
 auto-save-idle 3
 )
(auto-save-enable)
#+end_src

* 一个 buffer 时居中 buffer

#+begin_src emacs-lisp
(centered-window-mode t)
;; 增加centered-window-mode 最大宽度，以减少换行
(setq cwm-centered-window-width 120)
#+end_src


* scratch 默认使用 lisp-interaction-mode

#+begin_src emacs-lisp
(with-current-buffer "*scratch*"
  (lisp-interaction-mode)
    )
#+end_src

* 禁用 Doom 默认删除尾部空格

#+begin_src emacs-lisp
;;(package! ws-butler :disable t)
#+end_src

* 删除空格

#+begin_src emacs-lisp
;;(add-hook 'switch-buffer-functions
(add-hook 'windows-buffer-change-functions
          ;;(lambda (prev curr)
          (lambda (curr)
            (cl-assert (eq curr (current-buffer)))  ;; Always t
            (delete-trailing-whitespace)))
;; (save-excursion
;;   (save-restriction
;;     (narrow-to-region 1 (buffer-size switch-buffer-functions--last-buffer))
;;   )
;; )
#+end_src
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/Buffer-Size-_0026-Locations.html][Buffer Size and the Location of Point]]
- [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Narrowing.html][Narrowing]]
- [[https://emacs-china.org/t/window-buffer-change-hook/12645][window的buffer change hook]]

* 网易云音乐

#+begin_src emacs-lisp
;;(require 'netease-cloud-music)
#+end_src

* elfeed

#+begin_src emacs-lisp
(setq elfeed-feeds
      '(("https://mangatalk.net/feed" mangatalk)
        ))
#+end_src

* alda

#+begin_src emacs-lisp
(setq alda-binary-location "E:/alda/alda.exe")
#+end_src

* ivy

#+begin_src emacs-lisp
;;(use-package prescient
;;  :after counsel
;;  :config
;;  (prescient-persist-mode 1))
;;
;;(use-package ivy-prescient
;;  :after counsel
;;  :config (ivy-prescient-mode 1)
;;  )
#+end_src

* ivy posframe
#+begin_src emacs-lisp
;;(use-package ivy-posframe
;;  :disabled
;;  :custom
;;  (ivy-posframe-width      115)
;;  (ivy-posframe-min-width  115)
;;  (ivy-posframe-height     10)
;;  (ivy-posframe-min-height 10)
;;  :config
;;  (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
;;  (setq ivy-posframe-parameters '((parent-frame . nil)
;;                                  (left-fringe . 8)
;;                                  (right-fringe . 8)))
;;  (ivy-posframe-mode 1))
#+end_src

* counsel-fzf
#+begin_src emacs-lisp
;; (setq counsel--fzf-dir "C:/Users/Administrator/scoop/shims/")
#+end_src

* 取消显示行号

#+begin_src emacs-lisp
;;(setq display-line-numbers-type nil)
(remove-hook! '(prog-mode-hook text-mode-hook conf-mode-hook)
              #'display-line-numbers-mode)
#+end_src
- [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org][How do I change the style of line-numbers (or disable them altogether)?]]

* lsp

#+begin_src emacs-lisp
;; doom require =pip install pytest nose black=
;; 需要 npm i -g pyright

(require 'nox)

(setq nox-python-server "pyright")
(if (eq system-type 'windows-nt)
    (setq nox-python-path "E:/python/python3.8.1/python.exe"))
(setq nox-autoshutdown t) ;; kill bufer 时自动关闭nox的服务。
(dolist (hook (list
               ;;'js-mode-hook
               ;;'rust-mode-hook
               'python-mode-hook
               ;;'ruby-mode-hook
               ;;'java-mode-hook
               ;;'sh-mode-hook
               ;;'php-mode-hook
               ;;'c-mode-common-hook
               ;;'c-mode-hook
               ;;'csharp-mode-hook
               ;;'c++-mode-hook
               ;;'haskell-mode-hook
               ))
  (add-hook hook '(lambda () (nox-ensure))))
#+end_src
  
- [[https://rgoswami.me/posts/emacs-lang-servers/][Doom Emacs and Language Servers]]
- [[https://tecosaur.github.io/emacs-config/config.html][Doom Emacs Configuration]]
  
* Rust
#+begin_src emacs-lisp
;; rustup update
;; rustup component add rust-analysis rust-src
;; scoop install rust-analysis 
;; (setq rustic-lsp-server 'rust-analyzer)
(remove-hook 'rustic-mode-hook 'flycheck-mode)

(use-package! rustic
  :defer t
  :init
  (setq!
        lsp-rust-server 'rust-analyzer
        rustic-lsp-server 'rust-analyzer
        ;; rustic-lsp-client 'eglot
        lsp-rust-clippy-preference "on"
        
        )
  
  (remove-hook 'rustic-mode-hook 'flycheck-mode)
  )
(use-package! lsp-rust
  :config
  (setq!
         lsp-rust-analyzer-cargo-watch-enable t
         lsp-rust-analyzer-cargo-watch-command "clippy"
         lsp-rust-analyzer-proc-macro-enable t
         lsp-rust-analyzer-cargo-load-out-dirs-from-check t
         lsp-rust-analyzer-inlay-hints-mode t
         lsp-rust-analyzer-display-chaining-hints t
         lsp-rust-analyzer-display-parameter-hints t
         lsp-rust-analyzer-server-display-inlay-hints t
         )
  )

(after! rustic
  
      (map! :map rustic-mode-map
;;         "M-j" #'lsp-ui-imenu
        "<f12>" #'lsp-find-definition
        "M-<f12>" #'lsp-find-references
;;         "C-c C-c C-c" #'rustic-compile
;;         "C-c C-c l" #'flycheck-list-errors
;;         "C-c C-c a" #'lsp-execute-code-action
;;         "C-c C-c r" #'lsp-rename
;;         "C-c C-c q" #'lsp-workspace-restart
;;         "C-c C-c Q" #'lsp-workspace-shutdown
        "C-c C-c s" #'lsp-rust-analyzer-status
      )
  )

(after! lsp-ui
    (setq
     lsp-ui-doc-enable nil
     lsp-ui-doc-show-with-cursor nil
     lsp-ui-doc-show-with-mouse nil
     lsp-modeline-code-actions-enable nil
     lsp-modeline-diagnostics-enable nil
     )
                        )
(after! lsp-mode
  (setq
    lsp-headerline-breadcrumb-enable nil
    lsp-eldoc-enable-hover nil
     )
  )
;; (after! rustic
;;   ;; (add-hook 'lsp-mode-hook 'lsp-ui-mode)
;;     (setq
;;         rustic-lsp-server 'rust-analyzer ; optional
;;             ;; rustic-lsp-client 'eglot
;;         rustic-format-on-save nil
;;         rustic-lsp-client 'lsp-mode
;;             )
;;   )
;; (after! lsp-mode
;;   ;; what to use when checking on-save. "check" is default, I prefer clippy
;;   ;; (lsp-rust-analyzer-cargo-watch-command "clippy")
;;   (set-popup-rule! "^\\*lsp-help*" :ignore nil :actions: nil :side 'bottom :width 0.5 :quit 'current :select t :vslot 2 :slot 0)
;;   (setq
   
;;       lsp-eldoc-render-all t
;;       lsp-rust-server 'rust-analyzer
;;       lsp-enable-file-watchers nil
;;       lsp-completion-enable t
;;       lsp-enable-imenu t
;;       lsp-rust-analyzer-cargo-watch-enable nil
;;       lsp-log-io t
;;       lsp-ui-doc-delay 0.7
;;       lsp-ui-doc-enable nil
;;       lsp-ui-sideline-code-actions-prefix " "
;;       lsp-ui-sideline-show-hover nil
;;       lsp-rust-analyzer-server-display-inlay-hints t
;;       lsp-headerline-breadcrumb-enable t
;;       lsp-ui-peek-fontify 'always)
;; )
;; (after! (lsp-ui)
;;   (setq lsp-eldoc-enable-hover t
;;         lsp-enable-symbol-highlighting t
;;         lsp-ui-peek-always-show t
;;         lsp-ui-sideline-show-hover t
;;         )
;;   ;; (lsp-ui-doc-enable nil)
;;   )
;; (after! rustic-flycheck
;;   (setq rustic-flycheck-clippy-params (concat rustic-flycheck-clippy-params " --target x86_64-pc-windows-gnu"))
;;   (add-to-list 'flycheck-checkers 'rustic-clippy)
;;   (delete 'rust-clippy flycheck-checkers)
;;   (delete 'rust-cargo flycheck-checkers)
;;   (delete 'rust flycheck-checkers))
#+end_src
- [[https://dangirsh.org/projects/doom-config.html#rust][doom-config]]

* dap
#+begin_src emacs-lisp
;; Enabling only some features
;; (setq dap-auto-configure-features '(sessions locals controls tooltip))
#+end_src

* zone
#+begin_src emacs-lisp
(require 'zone-matrix)
;;(require 'zone-matrix-settings)
;;(require 'zone-settings)
(setq zone-programs [zone-matrix])

;;延时自动
;;(setq zone-timer (run-with-idle-timer 180 t 'zone))
#+end_src
* animate-birthday-present 
#+begin_src emacs-lisp
;;任意字符
#+end_src
* kana
#+begin_src emacs-lisp
(map!
(:after kana :map kana-mode-map
  :nm "v" #'kana-validate
  :nm "s" #'kana-say-question
  :nm "p" #'kana-previous
  :nm "n" #'kana-next
  :nm "t" #'kana-toggle-kana
  :nm "r" #'kana-toggle-random
  :nm "l" #'kana-loop-toggle
  :nm "]" #'kana-loop-inc
  :nm "[" #'kana-loop-dec
  :nm "a" #'kana-first
  :nm "j" #'kana-jump
  :nm "q" #'kana-quit
  :nm "d" #'kana-details)
                )
#+end_src

* good-scroll
#+begin_src emacs-lisp
(good-scroll-mode 1)
#+end_src

* vlf
#+begin_src emacs-lisp
(require  'vlf-setup)
(custom-set-variables
 '(vlf-application 'dont-ask)
 )
#+end_src

* awesome-tray-mode
#+begin_src emacs-lisp
(global-hide-mode-line-mode 1)
(require 'awesome-tray)
(awesome-tray-mode 1)
(setq
 awesome-tray-active-modules '("mode-name" "location" "buffer-name")
 awesome-tray-mode-line-active-color "White"
 )
#+end_src

* 自动显示换行
#+begin_src emacs-lisp
(global-visual-line-mode t)
#+end_src
- [[https://stackoverflow.com/questions/3281581/how-can-i-enable-line-wrap-on-word-boundaries-only-in-emacs][How can I enable line wrap on word boundaries only in Emacs?]]

* English
#+begin_src emacs-lisp
(require 'insert-translated-name)
(setq insert-translated-name-translate-engine "youdao")

(require 'company-english-helper)
#+end_src

* Company
#+begin_src emacs-lisp
;; 让 company 补全 yasnippet
(push 'company-yasnippet company-backends)
#+end_src
- [[https://emacs-china.org/t/company-yasnippet/7637][company-yasnippet 在补全提示中显示不出来]]

* 一些 mode添加 相对行号
#+begin_src emacs-lisp
;; (dolist (relativenumber (list
;;                ;;'js-mode-hook
;;                ;;'rust-mode-hook
;;                ;;'python-mode-hook
;;                'rustic-mode-hook
;;                'org-mode-hook
;;                'emacs-lisp-mode-hook
;;                ;;'sh-mode-hook
;;                ;;'c-mode-common-hook
;;                ;;'c-mode-hook
;;                ;;'haskell-mode-hook
;;                ))
;;   (add-hook relativenumber  '(lambda ()
;;                                (menu-bar--display-line-numbers-mode-relative)
;;                                )))
#+end_src
* eye-care
#+begin_src emacs-lisp
(require 'eye-care)
#+end_src
- [[https://www.chencanhao.com/Emacs/emacs-timer][定时提示休息眼睛的 elisp 插件]]

* beancount
#+begin_src emacs-lisp
(require 'beancount)
(add-to-list 'auto-mode-alist '("\\.beancount\\'" . beancount-mode))
#+end_src

* atomic-chrome
#+begin_src emacs-lisp
(require 'atomic-chrome)
#+end_src

* window-numbering
#+begin_src emacs-lisp
;; (window-numbering-mode 1)
#+end_src


